{
  "easy": [
    "The quick brown fox jumps over the lazy dog.",
    "Hello world, this is a simple typing test.",
    "Practice makes perfect when learning to type.",
    "Learning is a journey, not a destination.",
    "Every day is a chance to improve yourself.",
    "Stay focused and work hard on your dreams.",
    "Science helps us understand the world better.",
    "Reading opens doors to endless possibilities.",
    "Math teaches us to solve problems creatively.",
    "Bayanihan means helping each other succeed.",
    "Be kind, work hard, and stay humble always.",
    "Technology changes how we learn and connect.",
    "Study smart and take breaks when you need them.",
    "Your education is your greatest investment.",
    "Small steps lead to great achievements.",
    "Believe in yourself and your abilities today.",
    "Never stop asking questions about the world.",
    "Teamwork makes difficult tasks easier to finish.",
    "Mistakes are proof that you are trying hard.",
    "Set goals and celebrate your small victories.",
    "History teaches valuable lessons for tomorrow.",
    "Respect others and their different perspectives.",
    "Exercise your mind through reading and thinking.",
    "Honesty and integrity build strong character.",
    "Take care of your mental and physical health.",
    "Time management is key to student success.",
    "Creative thinking solves complex problems well.",
    "Listen carefully and learn from others daily.",
    "Every student has unique talents and strengths.",
    "Hard work beats talent when talent does not work.",
    "Stay curious about everything around you today.",
    "Balance study time with rest and relaxation.",
    "Good habits today create a better tomorrow.",
    "Digital skills are essential in modern careers.",
    "Keep learning and growing every single day.",
    "Kindness costs nothing but means everything.",
    "Books are windows to different worlds and ideas.",
    "Practice patience in all that you do daily.",
    "A positive attitude leads to positive outcomes.",
    "Challenge yourself to grow beyond your limits.",
    "Friendship and trust are built over time.",
    "Never underestimate the power of determination.",
    "Sleep well to keep your mind sharp and alert.",
    "Write down your thoughts and ideas regularly.",
    "Music can inspire and motivate us to achieve.",
    "Explore nature and appreciate its beauty often.",
    "Good communication starts with active listening.",
    "Learn from your mistakes and move forward.",
    "Help others without expecting anything in return.",
    "Stay organized to reduce stress and anxiety.",
    "Dreams become reality through hard work and faith.",
    "Laughter is the best medicine for the soul.",
    "Take pride in your work and your efforts.",
    "Knowledge shared is knowledge multiplied greatly.",
    "Be grateful for what you have right now.",
    "Face your fears with courage and confidence.",
    "Every sunrise brings new hope and opportunities.",
    "Think before you speak to avoid misunderstandings.",
    "Art allows us to express our deepest emotions.",
    "Persistence overcomes obstacles on the path ahead.",
    "Family support helps us through difficult times.",
    "Clean air and water are precious resources.",
    "Volunteer work enriches both giver and receiver.",
    "Sports teach discipline, teamwork, and fair play.",
    "Save money for future needs and emergencies.",
    "Study hard today for a better life tomorrow.",
    "Politeness and manners show respect for others.",
    "Questions lead to discoveries and new knowledge.",
    "Healthy eating fuels your body and mind well.",
    "Change is constant, so learn to adapt quickly.",
    "Respect nature and all living creatures equally.",
    "Your voice matters, so speak up with confidence.",
    "Patience and practice lead to skill mastery.",
    "Create something new and share it with others.",
    "Rest when tired, but never give up completely.",
    "Adventure awaits those who dare to explore.",
    "Learn something new every single day forward.",
    "Wisdom comes from experience and reflection.",
    "Build bridges, not walls, between people daily.",
    "Trust the process and enjoy the journey ahead.",
    "Celebrate diversity in all its beautiful forms.",
    "Hope keeps us moving forward through darkness.",
    "Plan ahead but remain flexible to changes.",
    "Technology should serve humanity, not control it.",
    "A smile can brighten someone's entire day.",
    "Keep your promises to build strong relationships.",
    "Listen to advice but make your own decisions.",
    "Protect the environment for future generations.",
    "Education opens doors to countless opportunities.",
    "Stay humble even when you achieve great success.",
    "Exercise regularly to maintain physical fitness.",
    "Forgiveness frees you from anger and resentment.",
    "Ask for help when you need it most.",
    "Innovation starts with creative thinking patterns.",
    "Quality is better than quantity in most things.",
    "Respect different cultures and their traditions.",
    "Focus on progress, not perfection every time.",
    "Stand up for what is right and just.",
    "Water your plants and watch them grow tall."
  ],
  "medium": [
    "In the midst of chaos, there is also opportunity. The wise warrior avoids the battle.",
    "Success is not final, failure is not fatal: it is the courage to continue that counts.",
    "The only impossible journey is the one you never begin. Believe in yourself always.",
    "To be yourself in a world that is constantly trying to make you something else is the greatest accomplishment.",
    "Life is what happens when you're busy making other plans. Always stay present in the moment.",
    "Filipino resilience and malasakit inspire us to care deeply for our community and nation.",
    "Critical thinking skills help students analyze information and make informed decisions daily.",
    "Climate change requires urgent action from every generation to protect our planet's future.",
    "Effective communication combines clear speaking, active listening, and genuine understanding.",
    "The scientific method teaches us to question, test, and verify our assumptions carefully.",
    "Financial literacy empowers young people to make smart decisions about money and savings.",
    "Artificial intelligence is transforming industries and creating new career opportunities worldwide.",
    "Strong reading comprehension skills are fundamental to success in all academic subjects.",
    "Mental health awareness helps students recognize stress and seek support when they need it.",
    "The arts foster creativity, self-expression, and cultural appreciation in meaningful ways.",
    "Environmental conservation starts with small actions like reducing waste and saving energy.",
    "Digital citizenship means using technology responsibly, safely, and ethically in all contexts.",
    "Historical understanding provides context for current events and shapes our future decisions.",
    "Collaboration and teamwork are valued skills in both academic and professional environments.",
    "Public speaking builds confidence and helps students articulate their ideas effectively.",
    "Coding and programming develop logical thinking and problem-solving abilities in learners.",
    "Cultural diversity enriches our society and teaches us to appreciate different perspectives.",
    "Time management strategies help balance academic work, activities, and personal well-being.",
    "Research skills enable students to find, evaluate, and use information from reliable sources.",
    "Entrepreneurial thinking encourages innovation, creativity, and taking calculated risks bravely.",
    "The diskarte of Filipino students shows resourcefulness and adaptability in challenging times.",
    "Social media literacy helps young people navigate online spaces wisely and protect privacy.",
    "STEM education prepares students for careers in science, technology, engineering, and mathematics.",
    "Leadership develops through practice, reflection, and learning from both success and failure.",
    "Global citizenship means understanding our interconnected world and acting with responsibility.",
    "Emotional intelligence helps us understand and manage our feelings and relate to others well.",
    "Career planning involves exploring interests, developing skills, and setting achievable goals.",
    "Data analysis skills are increasingly important across diverse fields and professional roles.",
    "Sustainable living practices help protect natural resources for current and future generations.",
    "Academic integrity and honesty form the foundation of trust in educational communities worldwide.",
    "Conflict resolution skills help navigate disagreements peacefully and find mutually beneficial solutions.",
    "The power of compound interest demonstrates how small, consistent savings grow into significant wealth over time.",
    "Mindfulness practices encourage present-moment awareness, reducing anxiety and improving overall mental well-being.",
    "Community service teaches empathy, civic responsibility, and the importance of contributing to society positively.",
    "Nutritional science helps us understand how food choices affect our health, energy levels, and longevity.",
    "Media production skills empower students to create content that informs, entertains, and inspires diverse audiences.",
    "Economic literacy enables young people to understand market forces, trade, and personal financial planning effectively.",
    "The pakikipagkapwa philosophy emphasizes treating others with dignity, respect, and genuine human connection.",
    "Project management involves planning, organizing resources, monitoring progress, and delivering results on schedule.",
    "Foreign language learning enhances cognitive abilities, cultural awareness, and communication skills across borders.",
    "Athletic training develops discipline, physical fitness, goal-setting abilities, and resilience through regular practice.",
    "Debate and argumentation teach students to construct logical arguments and consider multiple perspectives fairly.",
    "Graphic design combines artistic vision with technical skills to create visual communications that effectively convey messages.",
    "Sociology examines human behavior, social structures, and cultural patterns that shape our interactions and institutions.",
    "Marine biology explores ocean ecosystems, aquatic life, and conservation efforts to protect endangered marine species.",
    "Musical theory provides the foundation for understanding composition, harmony, rhythm, and the structure of sound.",
    "Psychology investigates mental processes, human behavior, emotions, and factors that influence personality development.",
    "Architectural design balances aesthetic beauty, functionality, sustainability, and engineering principles in built environments.",
    "Journalism requires accuracy, objectivity, thorough research, and ethical standards to inform the public responsibly.",
    "Agricultural science develops sustainable farming practices that increase food production while protecting the environment.",
    "The value of utang na loob teaches gratitude and reciprocity in relationships, strengthening social bonds and trust.",
    "Library science organizes information systems, preserves knowledge, and facilitates access to resources for all learners.",
    "Photography captures moments, tells stories, and expresses artistic vision through composition, lighting, and perspective.",
    "Political science analyzes government systems, policy-making processes, and the distribution of power within societies.",
    "Veterinary science combines animal care, medical knowledge, and compassion to promote the health and welfare of animals.",
    "Theater arts develop confidence, creativity, collaboration, and communication through performance and dramatic expression.",
    "Meteorology studies atmospheric phenomena, weather patterns, and climate systems to predict conditions and understand change.",
    "Culinary arts blend creativity, technique, cultural traditions, and scientific principles to prepare nutritious and delicious food.",
    "Anthropology examines human cultures, evolution, social practices, and archaeological evidence across time and geography.",
    "Physical therapy helps patients recover from injuries, manage pain, and improve mobility through evidence-based rehabilitation.",
    "The spirit of pagmamalasakit inspires healthcare professionals to provide compassionate, patient-centered care to all individuals.",
    "Event planning requires organizational skills, attention to detail, creative problem-solving, and effective coordination of resources.",
    "Astronomy explores celestial objects, cosmic phenomena, and the fundamental laws governing our vast universe.",
    "Public health addresses disease prevention, health promotion, and equitable access to healthcare services for entire populations.",
    "Fashion design combines artistic expression, technical construction, cultural influences, and market trends in wearable art.",
    "Chemistry studies matter, chemical reactions, molecular structures, and the properties that define different substances.",
    "Social entrepreneurship applies business principles to solve social problems and create positive community impact sustainably.",
    "Robotics engineering integrates mechanical design, electronics, programming, and artificial intelligence to create automated systems.",
    "The concept of hiya encourages social harmony through appropriate behavior, respect for others, and avoiding shame.",
    "Marketing strategy involves understanding consumer behavior, market research, branding, and effective communication of value.",
    "Geology examines Earth's structure, rocks, minerals, natural resources, and the processes shaping our planet's surface.",
    "Wildlife conservation protects endangered species, preserves habitats, and maintains biodiversity for ecological balance.",
    "Animation brings stories to life through artistic skill, technical software, timing, and creative visual storytelling.",
    "Nursing combines medical knowledge, patient care, empathy, and advocacy to support health and healing processes.",
    "Urban planning designs sustainable cities that balance housing, transportation, green spaces, and community needs effectively.",
    "Linguistics studies language structure, evolution, acquisition, and the diverse ways humans communicate across cultures.",
    "Occupational therapy helps individuals develop skills for daily living, work, and meaningful participation in community life.",
    "The tradition of pamanhikan demonstrates respect for family bonds and cultural customs in important life transitions.",
    "Forensic science applies scientific methods to investigate crimes, analyze evidence, and support justice systems.",
    "Interior design creates functional, aesthetic, and psychologically comfortable spaces that enhance quality of life.",
    "Ecology studies relationships between organisms and their environments, emphasizing interconnectedness in natural systems.",
    "Speech therapy assists individuals with communication disorders to improve language, articulation, and social interaction skills.",
    "Ethics examines moral principles, values, and philosophical questions about right and wrong in human conduct.",
    "Aerospace engineering designs aircraft, spacecraft, and systems that enable human flight and space exploration.",
    "The value of pakikisama promotes harmonious relationships through cooperation, flexibility, and getting along with others.",
    "Human resources management focuses on recruiting, developing, and supporting employees to build effective organizations.",
    "Paleontology studies fossils and ancient life forms to understand Earth's biological history and evolutionary processes.",
    "Textile science explores fabric production, material properties, and innovative applications in fashion and industry.",
    "International relations examines diplomatic interactions, global conflicts, cooperation, and power dynamics between nations.",
    "Pharmacology investigates drugs, their effects on biological systems, and therapeutic applications in treating diseases.",
    "The practice of bayanihan extends beyond physical help to include emotional support and community solidarity.",
    "Supply chain management coordinates production, distribution, and delivery of goods and services efficiently and cost-effectively."
  ],
  "hard": [
    "Programming is the art of telling another human what one wants the computer to do. It requires precision, logic, and creativity in equal measure.",
    "The difference between theory and practice is that in theory there is no difference, but in practice there is. This paradox applies to many areas of life.",
    "Innovation distinguishes between a leader and a follower. Those who dare to think differently often change the world in profound ways.",
    "The greatest glory in living lies not in never falling, but in rising every time we fall. Resilience, determination, and perseverance are the keys to success.",
    "Education is the most powerful weapon which you can use to change the world. Knowledge empowers individuals and transforms societies for the better.",
    "The Filipino spirit of bayanihan demonstrates that collective effort and community cooperation can overcome even the most challenging obstacles we face.",
    "Biotechnology and genetic engineering are revolutionizing medicine, agriculture, and environmental conservation through innovative scientific breakthroughs.",
    "Critical media literacy enables students to distinguish between credible information and misinformation in an increasingly complex digital landscape.",
    "Quantum computing represents a paradigm shift in processing power that will transform cryptography, drug discovery, and artificial intelligence applications.",
    "The intersection of cultural heritage and modern innovation creates unique opportunities for Filipino students to contribute meaningfully to global progress.",
    "Neuroplasticity reveals that our brains continuously adapt and rewire throughout our lives, emphasizing the importance of lifelong learning and growth.",
    "Sustainable development balances economic growth, social inclusion, and environmental protection to ensure prosperity for present and future generations.",
    "Cybersecurity professionals protect digital infrastructure from increasingly sophisticated threats, requiring constant learning and adaptation to new challenges.",
    "Philosophical inquiry encourages students to examine fundamental questions about existence, ethics, knowledge, and the nature of reality itself.",
    "The scientific revolution transformed human understanding through empirical observation, mathematical reasoning, and systematic experimentation over centuries.",
    "Interdisciplinary approaches combine insights from multiple fields to solve complex problems that single disciplines cannot address adequately alone.",
    "Machine learning algorithms enable computers to recognize patterns, make predictions, and improve performance through experience without explicit programming.",
    "Democratic participation requires informed citizens who critically evaluate policies, engage in civil discourse, and contribute to community decision-making.",
    "The malasakit shown by healthcare workers during crises exemplifies compassion, dedication, and selfless service to those in need of care and support.",
    "Renaissance polymaths demonstrated that excellence across multiple disciplines enriches understanding and fosters innovation through diverse perspectives.",
    "Blockchain technology creates decentralized, transparent, and secure systems that may fundamentally reshape finance, governance, and digital transactions.",
    "Cognitive biases systematically affect human judgment and decision-making, highlighting the importance of metacognition and critical self-reflection.",
    "Renewable energy technologies like solar, wind, and geothermal power offer sustainable alternatives to fossil fuels and help mitigate climate change impacts.",
    "The scientific peer review process ensures research quality through rigorous evaluation by experts, maintaining standards of accuracy and methodological soundness.",
    "Socioeconomic factors significantly influence educational outcomes, necessitating equitable policies that provide all students with opportunities to succeed.",
    "Artificial neural networks mimic biological brain structures to process information, enabling breakthroughs in image recognition, natural language, and more.",
    "The diskarte of Filipino entrepreneurs demonstrates resourcefulness, adaptability, and creative problem-solving in resource-constrained business environments.",
    "Bioethics examines moral implications of medical and biological research, balancing scientific advancement with respect for human dignity and rights.",
    "Globalization has interconnected economies, cultures, and societies, creating both opportunities for collaboration and challenges requiring diplomatic solutions.",
    "Genomic sequencing technologies allow scientists to read DNA, advancing personalized medicine, ancestry research, and understanding of genetic diseases.",
    "The philosophy of science investigates the foundations, methods, and implications of scientific inquiry, questioning assumptions underlying empirical knowledge.",
    "Mental health stigma prevention requires education, open dialogue, and cultural shifts that normalize seeking psychological support and prioritizing well-being.",
    "Nanotechnology manipulates matter at atomic and molecular scales, creating materials with novel properties for medicine, electronics, and manufacturing.",
    "The preservation of indigenous knowledge systems alongside modern science enriches our collective understanding and offers sustainable solutions to challenges.",
    "Electromagnetic spectrum applications range from radio communications to medical imaging, demonstrating physics principles that underpin modern technology.",
    "Epigenetics reveals that environmental factors and lifestyle choices can influence gene expression without altering DNA sequences, impacting health across generations.",
    "The philosophical concept of existentialism emphasizes individual freedom, personal responsibility, and the creation of meaning in an inherently uncertain world.",
    "Microeconomic theory analyzes individual decision-making, market mechanisms, supply and demand dynamics, and resource allocation efficiency in competitive environments.",
    "The pakikipagkapwa-tao worldview recognizes shared humanity, emphasizing interpersonal relationships, social harmony, and collective welfare over individualistic pursuits.",
    "Thermodynamics governs energy transformations, heat transfer, and entropy, establishing fundamental principles that constrain all physical processes in the universe.",
    "Postcolonial literary theory examines how colonialism shapes cultural identity, power structures, and representation in literature from formerly colonized nations.",
    "Immunology investigates the complex mechanisms by which organisms defend against pathogens, including cellular responses, antibody production, and immunological memory.",
    "Game theory mathematically models strategic interactions among rational decision-makers, predicting outcomes in competitive and cooperative scenarios across disciplines.",
    "The phenomenological approach in philosophy emphasizes direct experience and consciousness, examining how individuals perceive and interpret subjective reality.",
    "Astrophysics combines physics and astronomy to understand stellar evolution, galaxy formation, dark matter, dark energy, and the large-scale structure of the cosmos.",
    "Postmodernism challenges grand narratives, objective truth claims, and traditional authority, emphasizing pluralism, fragmentation, and the constructed nature of knowledge.",
    "Molecular biology elucidates cellular mechanisms at the molecular level, including DNA replication, transcription, translation, and protein synthesis regulation.",
    "The concept of kapwa transcends Western individualism, recognizing others as part of oneself and emphasizing authentic interpersonal connection and shared identity.",
    "Macroeconomic policy addresses aggregate variables like inflation, unemployment, GDP growth, and fiscal and monetary interventions to stabilize national economies.",
    "Cognitive psychology investigates mental processes including perception, memory, language, problem-solving, and decision-making using experimental and computational methods.",
    "Organic chemistry explores carbon-based compounds, reaction mechanisms, synthesis strategies, and the molecular basis of biological processes and pharmaceutical development.",
    "The dialectical method in philosophy involves examining contradictions, thesis-antithesis-synthesis progressions, and the dynamic nature of truth through reasoned discourse.",
    "Comparative literature analyzes texts across languages, cultures, and historical periods, revealing universal themes and culturally specific literary expressions.",
    "Neuroscience integrates biology, psychology, and computational modeling to understand brain structure, neural circuits, synaptic transmission, and cognitive functions.",
    "The Filipino concept of amor propio reflects personal dignity, self-esteem, and sensitivity to criticism, influencing social interactions and conflict resolution strategies.",
    "Statistical inference employs probability theory to draw conclusions from data, quantify uncertainty, test hypotheses, and make predictions about population parameters.",
    "Constitutional law examines fundamental legal principles, governmental powers, individual rights, judicial interpretation, and the balance between authority and liberty.",
    "Evolutionary biology explains biodiversity through natural selection, genetic drift, mutation, and adaptation, connecting all life forms through common ancestry.",
    "Symbolic interactionism in sociology emphasizes how individuals create meaning through social interaction, language, symbols, and shared interpretations of reality.",
    "The practice of pakikisama involves social acceptance, smooth interpersonal relations, and conformity to group norms, sometimes prioritizing harmony over individual preference.",
    "Differential equations model dynamic systems, describing rates of change in physics, engineering, economics, and biology through mathematical relationships.",
    "Existential psychology addresses meaning, authenticity, freedom, death awareness, and the human confrontation with existential anxieties in therapeutic contexts.",
    "Plate tectonics theory explains continental drift, earthquakes, volcanic activity, and mountain formation through the movement of lithospheric plates over geological time.",
    "Semiotics analyzes signs, symbols, and their meanings in communication systems, exploring how cultural codes and signification processes construct understanding.",
    "The bahala na attitude reflects Filipino fatalism, resilience, and trust in divine providence when facing uncertainty, combining risk-taking with acceptance of outcomes.",
    "Information theory quantifies communication, data compression, and transmission efficiency, establishing fundamental limits on signal processing and storage capacity.",
    "Poststructuralism deconstructs binary oppositions, questions stable meanings, and emphasizes the instability of language, identity, and social categories.",
    "Immunotherapy harnesses the body's immune system to fight diseases like cancer, representing a paradigm shift from traditional treatments to personalized medicine.",
    "The philosophy of mind investigates consciousness, mental causation, intentionality, qualia, and the relationship between mental states and physical brain processes.",
    "Econometrics applies statistical methods to economic data, testing theories, estimating relationships, and forecasting macroeconomic and microeconomic variables.",
    "Developmental psychology studies cognitive, emotional, and social changes across the lifespan, from prenatal development through aging and senescence.",
    "The hiya complex influences Filipino behavior through shame avoidance, propriety concerns, and sensitivity to social disapproval in interpersonal contexts.",
    "Topology examines spatial properties preserved under continuous transformations, abstracting geometry to study fundamental characteristics of mathematical spaces.",
    "Feminist theory critiques patriarchal structures, gender inequality, and power dynamics, advocating for women's rights and challenging traditional gender roles.",
    "Particle physics investigates fundamental constituents of matter, force-carrying particles, quantum field theory, and the Standard Model's predictive framework.",
    "The concept of utang na loob creates complex social obligations based on gratitude, debt of reciprocity, and moral duty in Filipino interpersonal relationships.",
    "Organizational behavior analyzes individual and group dynamics, motivation, leadership, communication, and organizational culture affecting workplace effectiveness.",
    "Relativity theory revolutionized physics by describing spacetime curvature, time dilation, length contraction, and the equivalence of mass and energy.",
    "Critical race theory examines how race, racism, and power intersect with law, institutions, and society, challenging colorblind approaches to inequality.",
    "Synthetic biology engineers biological systems using standardized parts, creating novel organisms, genetic circuits, and applications in medicine and manufacturing.",
    "The Filipino concept of pakikipagkapwa-loob emphasizes inner perception of others, authentic emotional connection, and treating others as fellow human beings.",
    "Operant conditioning explains learning through consequences, reinforcement schedules, punishment, and the shaping of behavior in psychological and educational contexts.",
    "String theory proposes that fundamental particles are one-dimensional strings vibrating at different frequencies, potentially unifying quantum mechanics and gravity.",
    "Deconstruction challenges logocentrism, binary hierarchies, and fixed meanings by revealing internal contradictions and instabilities within texts and philosophical systems.",
    "Stem cell research explores pluripotent cells capable of differentiating into various tissue types, offering regenerative medicine and therapeutic possibilities.",
    "The Filipino value of pagmamalasakit encompasses compassion, caring for others' welfare, and taking personal responsibility for community well-being.",
    "Linear algebra provides mathematical frameworks for vector spaces, matrix operations, eigenvalues, and transformations essential to computer graphics and data science.",
    "Psycholinguistics investigates language acquisition, processing, production, comprehension, and the cognitive mechanisms underlying human linguistic capabilities.",
    "Chaos theory examines deterministic systems exhibiting sensitive dependence on initial conditions, revealing order within apparent randomness and complex dynamics.",
    "Postcolonial studies analyze cultural, political, and economic legacies of colonialism, resistance movements, hybrid identities, and ongoing power imbalances.",
    "The concept of lakas ng loob reflects courage, inner strength, and determination to act despite fear, obstacles, or social pressure in Filipino culture.",
    "Behavioral economics integrates psychological insights into economic models, revealing how cognitive biases, heuristics, and emotions influence financial decisions.",
    "Molecular genetics elucidates heredity mechanisms, gene expression regulation, mutation effects, and the molecular basis of genetic disorders and traits.",
    "The Filipino notion of pakikipagpalagayang-loob involves acceptance, getting along with others, and maintaining harmonious relationships through accommodation.",
    "Algebraic geometry studies geometric objects defined by polynomial equations, connecting abstract algebra with spatial visualization and number theory.",
    "Environmental ethics examines moral relationships between humans and nature, questioning anthropocentrism and exploring sustainable, biocentric value systems.",
    "Proteomics analyzes protein structure, function, interactions, and expression patterns, providing insights into cellular processes and disease mechanisms.",
    "The value of kagandahang-loob reflects inner goodness, generosity, and selfless sharing of resources, time, and compassion with others in Filipino society."
  ]
}

