{
  "easy": [
    "The quick brown fox jumps over the lazy dog.",
    "Hello world, this is a simple typing test.",
    "Practice makes perfect when learning to type.",
    "Learning is a journey, not a destination.",
    "Every day is a chance to improve yourself.",
    "Stay focused and work hard on your dreams.",
    "Science helps us understand the world better.",
    "Reading opens doors to endless possibilities.",
    "Math teaches us to solve problems creatively.",
    "Bayanihan means helping each other succeed.",
    "Be kind, work hard, and stay humble always.",
    "Technology changes how we learn and connect.",
    "Study smart and take breaks when you need them.",
    "Your education is your greatest investment.",
    "Small steps lead to great achievements.",
    "Believe in yourself and your abilities today.",
    "Never stop asking questions about the world.",
    "Teamwork makes difficult tasks easier to finish.",
    "Mistakes are proof that you are trying hard.",
    "Set goals and celebrate your small victories.",
    "History teaches valuable lessons for tomorrow.",
    "Respect others and their different perspectives.",
    "Exercise your mind through reading and thinking.",
    "Honesty and integrity build strong character.",
    "Take care of your mental and physical health.",
    "Time management is key to student success.",
    "Creative thinking solves complex problems well.",
    "Listen carefully and learn from others daily.",
    "Every student has unique talents and strengths.",
    "Hard work beats talent when talent does not work.",
    "Stay curious about everything around you today.",
    "Balance study time with rest and relaxation.",
    "Good habits today create a better tomorrow.",
    "Digital skills are essential in modern careers.",
    "Keep learning and growing every single day."
  ],
  "medium": [
    "In the midst of chaos, there is also opportunity. The wise warrior avoids the battle.",
    "Success is not final, failure is not fatal: it is the courage to continue that counts.",
    "The only impossible journey is the one you never begin. Believe in yourself always.",
    "To be yourself in a world that is constantly trying to make you something else is the greatest accomplishment.",
    "Life is what happens when you're busy making other plans. Always stay present in the moment.",
    "Filipino resilience and malasakit inspire us to care deeply for our community and nation.",
    "Critical thinking skills help students analyze information and make informed decisions daily.",
    "Climate change requires urgent action from every generation to protect our planet's future.",
    "Effective communication combines clear speaking, active listening, and genuine understanding.",
    "The scientific method teaches us to question, test, and verify our assumptions carefully.",
    "Financial literacy empowers young people to make smart decisions about money and savings.",
    "Artificial intelligence is transforming industries and creating new career opportunities worldwide.",
    "Strong reading comprehension skills are fundamental to success in all academic subjects.",
    "Mental health awareness helps students recognize stress and seek support when they need it.",
    "The arts foster creativity, self-expression, and cultural appreciation in meaningful ways.",
    "Environmental conservation starts with small actions like reducing waste and saving energy.",
    "Digital citizenship means using technology responsibly, safely, and ethically in all contexts.",
    "Historical understanding provides context for current events and shapes our future decisions.",
    "Collaboration and teamwork are valued skills in both academic and professional environments.",
    "Public speaking builds confidence and helps students articulate their ideas effectively.",
    "Coding and programming develop logical thinking and problem-solving abilities in learners.",
    "Cultural diversity enriches our society and teaches us to appreciate different perspectives.",
    "Time management strategies help balance academic work, activities, and personal well-being.",
    "Research skills enable students to find, evaluate, and use information from reliable sources.",
    "Entrepreneurial thinking encourages innovation, creativity, and taking calculated risks bravely.",
    "The diskarte of Filipino students shows resourcefulness and adaptability in challenging times.",
    "Social media literacy helps young people navigate online spaces wisely and protect privacy.",
    "STEM education prepares students for careers in science, technology, engineering, and mathematics.",
    "Leadership develops through practice, reflection, and learning from both success and failure.",
    "Global citizenship means understanding our interconnected world and acting with responsibility.",
    "Emotional intelligence helps us understand and manage our feelings and relate to others well.",
    "Career planning involves exploring interests, developing skills, and setting achievable goals.",
    "Data analysis skills are increasingly important across diverse fields and professional roles.",
    "Sustainable living practices help protect natural resources for current and future generations.",
    "Academic integrity and honesty form the foundation of trust in educational communities worldwide."
  ],
  "hard": [
    "Programming is the art of telling another human what one wants the computer to do. It requires precision, logic, and creativity in equal measure.",
    "The difference between theory and practice is that in theory there is no difference, but in practice there is. This paradox applies to many areas of life.",
    "Innovation distinguishes between a leader and a follower. Those who dare to think differently often change the world in profound ways.",
    "The greatest glory in living lies not in never falling, but in rising every time we fall. Resilience, determination, and perseverance are the keys to success.",
    "Education is the most powerful weapon which you can use to change the world. Knowledge empowers individuals and transforms societies for the better.",
    "The Filipino spirit of bayanihan demonstrates that collective effort and community cooperation can overcome even the most challenging obstacles we face.",
    "Biotechnology and genetic engineering are revolutionizing medicine, agriculture, and environmental conservation through innovative scientific breakthroughs.",
    "Critical media literacy enables students to distinguish between credible information and misinformation in an increasingly complex digital landscape.",
    "Quantum computing represents a paradigm shift in processing power that will transform cryptography, drug discovery, and artificial intelligence applications.",
    "The intersection of cultural heritage and modern innovation creates unique opportunities for Filipino students to contribute meaningfully to global progress.",
    "Neuroplasticity reveals that our brains continuously adapt and rewire throughout our lives, emphasizing the importance of lifelong learning and growth.",
    "Sustainable development balances economic growth, social inclusion, and environmental protection to ensure prosperity for present and future generations.",
    "Cybersecurity professionals protect digital infrastructure from increasingly sophisticated threats, requiring constant learning and adaptation to new challenges.",
    "Philosophical inquiry encourages students to examine fundamental questions about existence, ethics, knowledge, and the nature of reality itself.",
    "The scientific revolution transformed human understanding through empirical observation, mathematical reasoning, and systematic experimentation over centuries.",
    "Interdisciplinary approaches combine insights from multiple fields to solve complex problems that single disciplines cannot address adequately alone.",
    "Machine learning algorithms enable computers to recognize patterns, make predictions, and improve performance through experience without explicit programming.",
    "Democratic participation requires informed citizens who critically evaluate policies, engage in civil discourse, and contribute to community decision-making.",
    "The malasakit shown by healthcare workers during crises exemplifies compassion, dedication, and selfless service to those in need of care and support.",
    "Renaissance polymaths demonstrated that excellence across multiple disciplines enriches understanding and fosters innovation through diverse perspectives.",
    "Blockchain technology creates decentralized, transparent, and secure systems that may fundamentally reshape finance, governance, and digital transactions.",
    "Cognitive biases systematically affect human judgment and decision-making, highlighting the importance of metacognition and critical self-reflection.",
    "Renewable energy technologies like solar, wind, and geothermal power offer sustainable alternatives to fossil fuels and help mitigate climate change impacts.",
    "The scientific peer review process ensures research quality through rigorous evaluation by experts, maintaining standards of accuracy and methodological soundness.",
    "Socioeconomic factors significantly influence educational outcomes, necessitating equitable policies that provide all students with opportunities to succeed.",
    "Artificial neural networks mimic biological brain structures to process information, enabling breakthroughs in image recognition, natural language, and more.",
    "The diskarte of Filipino entrepreneurs demonstrates resourcefulness, adaptability, and creative problem-solving in resource-constrained business environments.",
    "Bioethics examines moral implications of medical and biological research, balancing scientific advancement with respect for human dignity and rights.",
    "Globalization has interconnected economies, cultures, and societies, creating both opportunities for collaboration and challenges requiring diplomatic solutions.",
    "Genomic sequencing technologies allow scientists to read DNA, advancing personalized medicine, ancestry research, and understanding of genetic diseases.",
    "The philosophy of science investigates the foundations, methods, and implications of scientific inquiry, questioning assumptions underlying empirical knowledge.",
    "Mental health stigma prevention requires education, open dialogue, and cultural shifts that normalize seeking psychological support and prioritizing well-being.",
    "Nanotechnology manipulates matter at atomic and molecular scales, creating materials with novel properties for medicine, electronics, and manufacturing.",
    "The preservation of indigenous knowledge systems alongside modern science enriches our collective understanding and offers sustainable solutions to challenges.",
    "Electromagnetic spectrum applications range from radio communications to medical imaging, demonstrating physics principles that underpin modern technology."
  ]
}

